---
kind: property
id: P:Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.ResourceType
source: html/8b4fd48e-c825-fc8f-5bb8-f3899be5ff1a.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.ResourceType Property

The desired linked resource type.

## Syntax (C#)
```csharp
public ExternalResourceType ResourceType { get; }
```